hyeonwoo12/capstone2/Bootloader/lib/kinetis/NXP_Kinetis_Bootloader_2_0_0/src/platform/devices/MK81F25615/MK81F25615.h
/*! @name BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_BITER_ELINKYES_BITER_MASK            (0x1FFU)
#define DMA_BITER_ELINKYES_BITER_SHIFT           (0U)
#define DMA_BITER_ELINKYES_BITER(x)              (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_BITER_SHIFT)) & DMA_BITER_ELINKYES_BITER_MASK)
#define DMA_BITER_ELINKYES_LINKCH_MASK           (0x3E00U)
#define DMA_BITER_ELINKYES_LINKCH_SHIFT          (9U)
#define DMA_BITER_ELINKYES_LINKCH(x)             (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_BITER_ELINKYES_LINKCH_MASK)
#define DMA_BITER_ELINKYES_ELINK_MASK            (0x8000U)
#define DMA_BITER_ELINKYES_ELINK_SHIFT           (15U)
#define DMA_BITER_ELINKYES_ELINK(x)              (((uint16_t)(((uint16_t)(x)) << DMA_BITER_ELINKYES_ELINK_SHIFT)) & DMA_BITER_ELINKYES_ELINK_MASK)

/* The count of DMA_BITER_ELINKYES */
#define DMA_BITER_ELINKYES_COUNT                 (32U)


/*!
 * @}
 */ /* end of group DMA_Register_Masks */


/* DMA - Peripheral instance base addresses */
/** Peripheral DMA base address */
#define DMA_BASE                                 (0x40008000u)
/** Peripheral DMA base pointer */
#define DMA0                                     ((DMA_Type *)DMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { DMA_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA0 }
/** Interrupt vectors for the DMA peripheral type */
#define DMA_CHN_IRQS                             { DMA0_DMA16_IRQn, DMA1_DMA17_IRQn, DMA2_DMA18_IRQn, DMA3_DMA19_IRQn, DMA4_DMA20_IRQn, DMA5_DMA21_IRQn, DMA6_DMA22_IRQn, DMA7_DMA23_IRQn, DMA8_DMA24_IRQn, DMA9_DMA25_IRQn, DMA10_DMA26_IRQn, DMA11_DMA27_IRQn, DMA12_DMA28_IRQn, DMA13_DMA29_IRQn, DMA14_DMA30_IRQn, DMA15_DMA31_IRQn, DMA0_DMA16_IRQn, DMA1_DMA17_IRQn, DMA2_DMA18_IRQn, DMA3_DMA19_IRQn, DMA4_DMA20_IRQn, DMA5_DMA21_IRQn, DMA6_DMA22_IRQn, DMA7_DMA23_IRQn, DMA8_DMA24_IRQn, DMA9_DMA25_IRQn, DMA10_DMA26_IRQn, DMA11_DMA27_IRQn, DMA12_DMA28_IRQn, DMA13_DMA29_IRQn, DMA14_DMA30_IRQn, DMA15_DMA31_IRQn }
#define DMA_ERROR_IRQS                           { DMA_Error_IRQn }

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMAMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Peripheral_Access_Layer DMAMUX Peripheral Access Layer
 * @{
 */

/** DMAMUX - Register Layout Typedef */
typedef struct {
  __IO uint8_t CHCFG[32];                          /**< Channel Configuration register, array offset: 0x0, array step: 0x1 */
} DMAMUX_Type;

/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Masks DMAMUX Register Masks
 * @{
 */

/*! @name CHCFG - Channel Configuration register */
#define DMAMUX_CHCFG_SOURCE_MASK                 (0x3FU)
#define DMAMUX_CHCFG_SOURCE_SHIFT                (0U)
#define DMAMUX_CHCFG_SOURCE(x)                   (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_SOURCE_SHIFT)) & DMAMUX_CHCFG_SOURCE_MASK)
#define DMAMUX_CHCFG_TRIG_MASK                   (0x40U)
#define DMAMUX_CHCFG_TRIG_SHIFT                  (6U)
#define DMAMUX_CHCFG_TRIG(x)                     (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_TRIG_SHIFT)) & DMAMUX_CHCFG_TRIG_MASK)
#define DMAMUX_CHCFG_ENBL_MASK                   (0x80U)
#define DMAMUX_CHCFG_ENBL_SHIFT                  (7U)
#define DMAMUX_CHCFG_ENBL(x)                     (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_ENBL_SHIFT)) & DMAMUX_CHCFG_ENBL_MASK)

/* The count of DMAMUX_CHCFG */
#define DMAMUX_CHCFG_COUNT                       (32U)


/*!
 * @}
 */ /* end of group DMAMUX_Register_Masks */


/* DMAMUX - Peripheral instance base addresses */
/** Peripheral DMAMUX base address */
#define DMAMUX_BASE                              (0x40021000u)
/** Peripheral DMAMUX base pointer */
#define DMAMUX                                   ((DMAMUX_Type *)DMAMUX_BASE)
/** Array initializer of DMAMUX peripheral base addresses */
#define DMAMUX_BASE_ADDRS                        { DMAMUX_BASE }
/** Array initializer of DMAMUX peripheral base pointers */
#define DMAMUX_BASE_PTRS                         { DMAMUX }

/*!
 * @}
 */ /* end of group DMAMUX_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DRY Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DRY_Peripheral_Access_Layer DRY Peripheral Access Layer
 * @{
 */

/** DRY - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t SKVR;                              /**< DryIce Secure Key Valid Register, offset: 0x4 */
  __IO uint32_t SKWLR;                             /**< DryIce Secure Key Write Lock Register, offset: 0x8 */
  __IO uint32_t SKRLR;                             /**< DryIce Secure Key Read Lock Register, offset: 0xC */
  __IO uint32_t CR;                                /**< DryIce Control Register, offset: 0x10 */
  __IO uint32_t SR;                                /**< DryIce Status Register, offset: 0x14 */
  __IO uint32_t LR;                                /**< DryIce Lock Register, offset: 0x18 */
  __IO uint32_t IER;                               /**< DryIce Interrupt Enable Register, offset: 0x1C */
  __IO uint32_t TSR;                               /**< DryIce Tamper Seconds Register, offset: 0x20 */
  __IO uint32_t TER;                               /**< DryIce Tamper Enable Register, offset: 0x24 */
  __IO uint32_t PDR;                               /**< DryIce Pin Direction Register, offset: 0x28 */
  __IO uint32_t PPR;                               /**< DryIce Pin Polarity Register, offset: 0x2C */
  __IO uint32_t ATR[2];                            /**< DryIce Active Tamper Register, array offset: 0x30, array step: 0x4 */
       uint8_t RESERVED_1[8];
  __IO uint32_t PGFR[8];                           /**< DryIce Pin Glitch Filter Register, array offset: 0x40, array step: 0x4 */
       uint8_t RESERVED_2[1952];
  __IO uint32_t WAC;                               /**< DryIce Write Access Control Register, offset: 0x800 */
  __IO uint32_t RAC;                               /**< DryIce Read Access Control Register, offset: 0x804 */
       uint8_t RESERVED_3[2040];
  __IO uint32_t SKR[8];                            /**< Secure Key Register, array offset: 0x1000, array step: 0x4 */
       uint8_t RESERVED_4[2016];
  __IO uint32_t SWAC;                              /**< Secure Write Access Control, offset: 0x1800 */
  __IO uint32_t SRAC;                              /**< Secure Read Access Control, offset: 0x1804 */
} DRY_Type;

/* ----------------------------------------------------------------------------
   -- DRY Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DRY_Register_Masks DRY Register Masks
 * @{
 */

/*! @name SKVR - DryIce Secure Key Valid Register */
#define DRY_SKVR_SKV_MASK                        (0xFFU)
#define DRY_SKVR_SKV_SHIFT                       (0U)
#define DRY_SKVR_SKV(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_SKVR_SKV_SHIFT)) & DRY_SKVR_SKV_MASK)

/*! @name SKWLR - DryIce Secure Key Write Lock Register */
#define DRY_SKWLR_SKWL_MASK                      (0xFFU)
#define DRY_SKWLR_SKWL_SHIFT                     (0U)
#define DRY_SKWLR_SKWL(x)                        (((uint32_t)(((uint32_t)(x)) << DRY_SKWLR_SKWL_SHIFT)) & DRY_SKWLR_SKWL_MASK)

/*! @name SKRLR - DryIce Secure Key Read Lock Register */
#define DRY_SKRLR_SKRL_MASK                      (0xFFU)
#define DRY_SKRLR_SKRL_SHIFT                     (0U)
#define DRY_SKRLR_SKRL(x)                        (((uint32_t)(((uint32_t)(x)) << DRY_SKRLR_SKRL_SHIFT)) & DRY_SKRLR_SKRL_MASK)

