hyeonwoo12/capstone2/Bootloader/lib/kinetis/NXP_Kinetis_Bootloader_2_0_0/src/platform/devices/MK81F25615/MK81F25615.h
/*! @name PPR - DryIce Pin Polarity Register */
#define DRY_PPR_TPP_MASK                         (0xFFU)
#define DRY_PPR_TPP_SHIFT                        (0U)
#define DRY_PPR_TPP(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_PPR_TPP_SHIFT)) & DRY_PPR_TPP_MASK)
#define DRY_PPR_TPID_MASK                        (0xFF0000U)
#define DRY_PPR_TPID_SHIFT                       (16U)
#define DRY_PPR_TPID(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PPR_TPID_SHIFT)) & DRY_PPR_TPID_MASK)

/*! @name ATR - DryIce Active Tamper Register */
#define DRY_ATR_ATSR_MASK                        (0xFFFFU)
#define DRY_ATR_ATSR_SHIFT                       (0U)
#define DRY_ATR_ATSR(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_ATR_ATSR_SHIFT)) & DRY_ATR_ATSR_MASK)
#define DRY_ATR_ATP_MASK                         (0xFFFF0000U)
#define DRY_ATR_ATP_SHIFT                        (16U)
#define DRY_ATR_ATP(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_ATR_ATP_SHIFT)) & DRY_ATR_ATP_MASK)

/* The count of DRY_ATR */
#define DRY_ATR_COUNT                            (2U)

/*! @name PGFR - DryIce Pin Glitch Filter Register */
#define DRY_PGFR_GFW_MASK                        (0x3FU)
#define DRY_PGFR_GFW_SHIFT                       (0U)
#define DRY_PGFR_GFW(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_GFW_SHIFT)) & DRY_PGFR_GFW_MASK)
#define DRY_PGFR_GFP_MASK                        (0x40U)
#define DRY_PGFR_GFP_SHIFT                       (6U)
#define DRY_PGFR_GFP(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_GFP_SHIFT)) & DRY_PGFR_GFP_MASK)
#define DRY_PGFR_GFE_MASK                        (0x80U)
#define DRY_PGFR_GFE_SHIFT                       (7U)
#define DRY_PGFR_GFE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_GFE_SHIFT)) & DRY_PGFR_GFE_MASK)
#define DRY_PGFR_TPSW_MASK                       (0x300U)
#define DRY_PGFR_TPSW_SHIFT                      (8U)
#define DRY_PGFR_TPSW(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_TPSW_SHIFT)) & DRY_PGFR_TPSW_MASK)
#define DRY_PGFR_TPSF_MASK                       (0xC00U)
#define DRY_PGFR_TPSF_SHIFT                      (10U)
#define DRY_PGFR_TPSF(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_TPSF_SHIFT)) & DRY_PGFR_TPSF_MASK)
#define DRY_PGFR_TPEX_MASK                       (0x30000U)
#define DRY_PGFR_TPEX_SHIFT                      (16U)
#define DRY_PGFR_TPEX(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_TPEX_SHIFT)) & DRY_PGFR_TPEX_MASK)
#define DRY_PGFR_TPE_MASK                        (0x1000000U)
#define DRY_PGFR_TPE_SHIFT                       (24U)
#define DRY_PGFR_TPE(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_TPE_SHIFT)) & DRY_PGFR_TPE_MASK)
#define DRY_PGFR_TPS_MASK                        (0x2000000U)
#define DRY_PGFR_TPS_SHIFT                       (25U)
#define DRY_PGFR_TPS(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_PGFR_TPS_SHIFT)) & DRY_PGFR_TPS_MASK)

/* The count of DRY_PGFR */
#define DRY_PGFR_COUNT                           (8U)

/*! @name WAC - DryIce Write Access Control Register */
#define DRY_WAC_SKVW_MASK                        (0x2U)
#define DRY_WAC_SKVW_SHIFT                       (1U)
#define DRY_WAC_SKVW(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_WAC_SKVW_SHIFT)) & DRY_WAC_SKVW_MASK)
#define DRY_WAC_SKWRW_MASK                       (0x4U)
#define DRY_WAC_SKWRW_SHIFT                      (2U)
#define DRY_WAC_SKWRW(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_WAC_SKWRW_SHIFT)) & DRY_WAC_SKWRW_MASK)
#define DRY_WAC_SKRRW_MASK                       (0x8U)
#define DRY_WAC_SKRRW_SHIFT                      (3U)
#define DRY_WAC_SKRRW(x)                         (((uint32_t)(((uint32_t)(x)) << DRY_WAC_SKRRW_SHIFT)) & DRY_WAC_SKRRW_MASK)
#define DRY_WAC_CRW_MASK                         (0x10U)
#define DRY_WAC_CRW_SHIFT                        (4U)
#define DRY_WAC_CRW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_CRW_SHIFT)) & DRY_WAC_CRW_MASK)
#define DRY_WAC_SRW_MASK                         (0x20U)
#define DRY_WAC_SRW_SHIFT                        (5U)
#define DRY_WAC_SRW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_SRW_SHIFT)) & DRY_WAC_SRW_MASK)
#define DRY_WAC_LRW_MASK                         (0x40U)
#define DRY_WAC_LRW_SHIFT                        (6U)
#define DRY_WAC_LRW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_LRW_SHIFT)) & DRY_WAC_LRW_MASK)
#define DRY_WAC_IEW_MASK                         (0x80U)
#define DRY_WAC_IEW_SHIFT                        (7U)
#define DRY_WAC_IEW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_IEW_SHIFT)) & DRY_WAC_IEW_MASK)
#define DRY_WAC_TSRW_MASK                        (0x100U)
#define DRY_WAC_TSRW_SHIFT                       (8U)
#define DRY_WAC_TSRW(x)                          (((uint32_t)(((uint32_t)(x)) << DRY_WAC_TSRW_SHIFT)) & DRY_WAC_TSRW_MASK)
#define DRY_WAC_TEW_MASK                         (0x200U)
#define DRY_WAC_TEW_SHIFT                        (9U)
#define DRY_WAC_TEW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_TEW_SHIFT)) & DRY_WAC_TEW_MASK)
#define DRY_WAC_PDW_MASK                         (0x400U)
#define DRY_WAC_PDW_SHIFT                        (10U)
#define DRY_WAC_PDW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_PDW_SHIFT)) & DRY_WAC_PDW_MASK)
#define DRY_WAC_PPW_MASK                         (0x800U)
#define DRY_WAC_PPW_SHIFT                        (11U)
#define DRY_WAC_PPW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_PPW_SHIFT)) & DRY_WAC_PPW_MASK)
#define DRY_WAC_ATW_MASK                         (0x3000U)
#define DRY_WAC_ATW_SHIFT                        (12U)
#define DRY_WAC_ATW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_ATW_SHIFT)) & DRY_WAC_ATW_MASK)
#define DRY_WAC_GFW_MASK                         (0xFF0000U)
#define DRY_WAC_GFW_SHIFT                        (16U)
#define DRY_WAC_GFW(x)                           (((uint32_t)(((uint32_t)(x)) << DRY_WAC_GFW_SHIFT)) & DRY_WAC_GFW_MASK)

